renesas/amazon-freertos/lib/ota/portable/renesas/rx65n-rsk/type4/aws_ota_pal.c
            if( CRYPTO_SignatureVerificationFinal( pvSigVerifyContext, ( char * ) pucSignerCert, ulSignerCertSize,
                                                   C->pxSignature->ucData, C->pxSignature->usSize ) == pdFALSE )
            {
                OTA_LOG_L1( "[%s] ERROR: Finished %s signature verification, but signature verification failed\r\n", OTA_METHOD_NAME,
                    cOTA_JSON_FileSignatureKey );
                eResult = kOTA_Err_SignatureCheckFailed;
            }
            else
            {
                OTA_LOG_L1( "[%s] PASS: Finished %s signature verification, signature verification passed\r\n", OTA_METHOD_NAME,
                    cOTA_JSON_FileSignatureKey );
                eResult = kOTA_Err_None;
            }
        }
    }

    /* Free the signer certificate that we now own after prvPAL_ReadAndAssumeCertificate(). */
    if( pucSignerCert != NULL )
    {
        vPortFree( pucSignerCert );
    }

    return eResult;
}
/*-----------------------------------------------------------*/

static uint8_t * prvPAL_ReadAndAssumeCertificate( const uint8_t * const pucCertName,
                                                  uint32_t * const ulSignerCertSize )
{
    DEFINE_OTA_METHOD_NAME( "prvPAL_ReadAndAssumeCertificate" );

    uint8_t * pucCertData;
    uint32_t ulCertSize;
    uint8_t * pucSignerCert = NULL;
    CK_RV xResult;

    xResult = prvGetCertificate( ( const char * ) pucCertName, &pucSignerCert, ulSignerCertSize );

    if( ( xResult == CKR_OK ) && ( pucSignerCert != NULL ) )
    {
        OTA_LOG_L1( "[%s] Using cert with label: %s OK\r\n", OTA_METHOD_NAME, ( const char * ) pucCertName );
    }
    else
    {
        OTA_LOG_L1( "[%s] No such certificate file: %s. Using aws_ota_codesigner_certificate.h.\r\n", OTA_METHOD_NAME,
                    ( const char * ) pucCertName );

        /* Allocate memory for the signer certificate plus a terminating zero so we can copy it and return to the caller. */
        ulCertSize = sizeof( signingcredentialSIGNING_CERTIFICATE_PEM );
        pucSignerCert = pvPortMalloc( ulCertSize + 1 );                       /*lint !e9029 !e9079 !e838 malloc proto requires void*. */
        pucCertData = ( uint8_t * ) signingcredentialSIGNING_CERTIFICATE_PEM; /*lint !e9005 we don't modify the cert but it could be set by PKCS11 so it's not const. */

        if( pucSignerCert != NULL )
        {
            memcpy( pucSignerCert, pucCertData, ulCertSize );
            /* The crypto code requires the terminating zero to be part of the length so add 1 to the size. */
            pucSignerCert[ ulCertSize ] = 0U;
            *ulSignerCertSize = ulCertSize + 1U;
        }
        else
        {
            OTA_LOG_L1( "[%s] Error: No memory for certificate of size %d!\r\n", OTA_METHOD_NAME, ulCertSize );
        }
    }

    return pucSignerCert;
}
/*-----------------------------------------------------------*/

OTA_Err_t prvPAL_ResetDevice( void )
{
    DEFINE_OTA_METHOD_NAME("prvPAL_ResetDevice");

    OTA_LOG_L1( "[%s] Resetting the device.\r\n", OTA_METHOD_NAME );

	if ((eOTA_ImageState_Accepted == load_firmware_control_block.eSavedAgentState) ||
	    (eOTA_ImageState_Testing == load_firmware_control_block.eSavedAgentState))
	{
	    /* Software reset issued (Not swap bank) */
	    set_psw(0);
	    R_BSP_InterruptsDisable();
	    R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);
	    SYSTEM.SWRR = 0xa501;
		while(1);	/* software reset */
	}
	else
	{
		/* If the status is rejected, aborted, or error, swap bank and return to the previous image.
		   Then the boot loader will start and erase the image that failed to update. */
	    set_psw(0);
    	R_BSP_InterruptsDisable();
    	R_FLASH_Control(FLASH_CMD_BANK_TOGGLE, NULL);
    	R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);
    	SYSTEM.SWRR = 0xa501;
    	while(1);   /* software reset */
	}

    /* We shouldn't actually get here if the board supports the auto reset.
     * But, it doesn't hurt anything if we do although someone will need to
     * reset the device for the new image to boot. */
    return kOTA_Err_None;
}
/*-----------------------------------------------------------*/

OTA_Err_t prvPAL_ActivateNewImage( void )
{
    DEFINE_OTA_METHOD_NAME("prvPAL_ActivateNewImage");

    OTA_LOG_L1( "[%s] Changing the Startup Bank\r\n", OTA_METHOD_NAME );

    /* reset for self testing */
	vTaskDelay(5000);
	prvPAL_ResetDevice();	/* no return from this function */

    return kOTA_Err_None;
}
/*-----------------------------------------------------------*/

OTA_Err_t prvPAL_SetPlatformImageState( OTA_ImageState_t eState )
{
	flash_interrupt_config_t cb_func_info;

    DEFINE_OTA_METHOD_NAME( "prvPAL_SetPlatformImageState" );
    OTA_LOG_L1("[%s] is called.\r\n", OTA_METHOD_NAME);

    OTA_Err_t eResult = kOTA_Err_Uninitialized;

	/* Save the image state to eSavedAgentState. */
	load_firmware_control_block.eSavedAgentState = eState;
	if (firmware_update_control_block_bank0->image_flag == LIFECYCLE_STATE_VALID)
	{
		switch (eState)
		{
			case eOTA_ImageState_Accepted:
				R_FLASH_Close();
				R_FLASH_Open();
				cb_func_info.pcallback = ota_header_flashing_callback;
				cb_func_info.int_priority = FLASH_INTERRUPT_PRIORITY;
				R_FLASH_Control(FLASH_CMD_SET_BGO_CALLBACK, (void *)&cb_func_info);

				gs_header_flashing_task = OTA_FLASHING_IN_PROGRESS;
				if (R_FLASH_Erase((flash_block_address_t)BOOT_LOADER_UPDATE_TEMPORARY_AREA_HIGH_ADDRESS, BOOT_LOADER_UPDATE_TARGET_BLOCK_NUMBER) == FLASH_SUCCESS)
				{
					while (OTA_FLASHING_IN_PROGRESS == gs_header_flashing_task);
					OTA_LOG_L1( "[%s] erase install area (code flash):OK\r\n", OTA_METHOD_NAME );
					OTA_LOG_L1( "[%s] Accepted and committed final image.\r\n", OTA_METHOD_NAME );
					eResult = kOTA_Err_None;
				}
				else
				{
					OTA_LOG_L1( "[%s] erase install area (code flash):NG\r\n", OTA_METHOD_NAME );
					OTA_LOG_L1( "[%s] Accepted final image but commit failed (%d).\r\n", OTA_METHOD_NAME );
					eResult = kOTA_Err_CommitFailed;
				}
				break;
			case eOTA_ImageState_Rejected:
				OTA_LOG_L1( "[%s] Rejected image.\r\n", OTA_METHOD_NAME );
				eResult = kOTA_Err_None;
				break;
			case eOTA_ImageState_Aborted:
				OTA_LOG_L1( "[%s] Aborted image.\r\n", OTA_METHOD_NAME );
				eResult = kOTA_Err_None;
				break;
			case eOTA_ImageState_Testing:
				OTA_LOG_L1( "[%s] Testing.\r\n", OTA_METHOD_NAME );
				eResult = kOTA_Err_None;
				break;
			default:
				OTA_LOG_L1( "[%s] Unknown state received %d.\r\n", OTA_METHOD_NAME, ( int32_t ) eState );
		        eResult = kOTA_Err_BadImageState;
				break;
		}
	}
	else
	{
		switch (eState)
		{
			case eOTA_ImageState_Accepted:
				OTA_LOG_L1( "[%s] Not in commit pending so can not mark image valid (%d).\r\n", OTA_METHOD_NAME);
				eResult = kOTA_Err_CommitFailed;
				break;
			case eOTA_ImageState_Rejected:
				OTA_LOG_L1( "[%s] Rejected image.\r\n", OTA_METHOD_NAME );
				eResult = kOTA_Err_None;
				break;
			case eOTA_ImageState_Aborted:
				OTA_LOG_L1( "[%s] Aborted image.\r\n", OTA_METHOD_NAME );
				eResult = kOTA_Err_None;
				break;
			case eOTA_ImageState_Testing:
				OTA_LOG_L1( "[%s] Testing.\r\n", OTA_METHOD_NAME );
				eResult = kOTA_Err_None;
				break;
			default:
				OTA_LOG_L1( "[%s] Unknown state received %d.\r\n", OTA_METHOD_NAME, ( int32_t ) eState );
		        eResult = kOTA_Err_BadImageState;
				break;
		}
	}

    return eResult;
}
/*-----------------------------------------------------------*/

