renesas/amazon-freertos/lib/ota/portable/renesas/rx65n-rsk/type4/aws_ota_pal.c
		gs_header_flashing_task = OTA_FLASHING_IN_PROGRESS;
		length = BOOT_LOADER_USER_FIRMWARE_HEADER_LENGTH;
		flash_err = R_FLASH_Write((uint32_t)block, (uint32_t)BOOT_LOADER_UPDATE_TEMPORARY_AREA_LOW_ADDRESS, length);
		if(flash_err != FLASH_SUCCESS)
		{
			nop();
		}
		while (OTA_FLASHING_IN_PROGRESS == gs_header_flashing_task);
	}

	return ret;
}

static void ota_context_close( OTA_FileContext_t * C )
{
    if( NULL != C )
    {
        C->pucFile = NULL;
    }
}


static void ota_flashing_task( void * pvParameters )
{
	flash_err_t flash_err;
	static uint8_t block[(1 << otaconfigLOG2_FILE_BLOCK_SIZE)];
	static uint32_t ulOffset;
	static uint32_t length;

	while(1)
	{
		xQueueReceive(xQueue, &packet_block_for_queue2, portMAX_DELAY);
		xSemaphoreTake(xSemaphoreFlashig, portMAX_DELAY);
		memcpy(block, packet_block_for_queue2.p_packet, sizeof(block));
		ulOffset = packet_block_for_queue2.ulOffset;
		length = packet_block_for_queue2.length;
		flash_err = R_FLASH_Write((uint32_t)block, ulOffset + (uint32_t)BOOT_LOADER_UPDATE_TEMPORARY_AREA_LOW_ADDRESS, length);
		if(packet_block_for_queue2.length != 1024)
		{
			nop();
		}
		if(flash_err != FLASH_SUCCESS)
		{
			nop();
		}
		vPortFree(packet_block_for_queue2.p_packet);
#ifdef otatestFLASHING_WAIT_ENABLE
		R_BSP_SoftwareDelay(300, BSP_DELAY_MILLISECS);
#endif
	}
}

static void ota_flashing_callback(void *event)
{
	uint32_t event_code;
	event_code = *((uint32_t*)event);

    if((event_code != FLASH_INT_EVENT_WRITE_COMPLETE) || (event_code == FLASH_INT_EVENT_ERASE_COMPLETE))
    {
    	nop(); /* trap */
    }
	static portBASE_TYPE xHigherPriorityTaskWoken;
	xSemaphoreGiveFromISR(xSemaphoreFlashig, &xHigherPriorityTaskWoken);
}

static void ota_header_flashing_callback(void *event)
{
	uint32_t event_code;
	event_code = *((uint32_t*)event);

	gs_header_flashing_task = OTA_FLASHING_COMPLETE;

    if((event_code != FLASH_INT_EVENT_WRITE_COMPLETE) || (event_code == FLASH_INT_EVENT_ERASE_COMPLETE))
    {
    	nop(); /* trap */
    }
	static portBASE_TYPE xHigherPriorityTaskWoken;
}

